{"text": "My son, the Skyrim junky, loves this shirt!", "label": 0, "label_text": "not-counterfactual"}
{"text": "They wont know the difference between a true flat sound and a bass heavier sound.", "label": 0, "label_text": "not-counterfactual"}
{"text": "We then had our first draping class and i made a lace top for myself using the dress form.", "label": 0, "label_text": "not-counterfactual"}
{"text": "They are good quality and the colors are vibrant!", "label": 0, "label_text": "not-counterfactual"}
{"text": "* Set up instructions are easy until something doesn't work quite right (inputs) and a lot of time can be spent trying to tweak the remote.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It also came with a two button remote, which I wasn't expecting.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I was happily surprised that my nutcracker was a signed edition.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It is small, but holds a dryer load of shirts and shorts.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The hamper is also very well made and will hold atleast 2 loads of laundry inside it easily.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I was hopping to have this for music on the deck.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Must read for believers looking for more of God and his glory.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Not satisfied at all, did not stick to my car at all and I did wipe it down first.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The tools are worthless to me...even with the extension I have to get down on the floor to vacuum the edges with the crevice tool.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It was really hard to like Harrison, although I wanted to!", "label": 0, "label_text": "not-counterfactual"}
{"text": "The material is soft and breathy... wish it came in more choice of colors.", "label": 1, "label_text": "counterfactual"}
{"text": "My nephew who is a basketball player himself is a huge fan of Carmelo, so I thought getting him a photo for his wall would be a great Easter gift for his basketball themed Easter basket.", "label": 0, "label_text": "not-counterfactual"}
{"text": "And, they're the best priced headphones you'll find.", "label": 0, "label_text": "not-counterfactual"}
{"text": "They shipped quickly, the color perfectly matched the online picture.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This cable came as advertised and is pretty thick.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It would be too hard to get the top, bottom and edges of the walls if it didn't bend.", "label": 1, "label_text": "counterfactual"}
{"text": "5 STARS GIVEN IN THE HOPES THAT WITH GOOD RATINGS THIS PRODUCT WILL BE USED TO MAKE OTHERS FEEL MY PAIN.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Its very sexy and snug, and short...so now I'll be busting my *ss at the gym until I can wear it and not worry about my muffin.", "label": 0, "label_text": "not-counterfactual"}
{"text": "\"A LITTLE SMALLER THEN I HAD HOPED FOR, BUT THEY ARE BEAUTIFUL AND WILL ADD A MEASURE OF \\GORGEOUS\\\"\" TO ANY PIECE I ADD THEM TO.\"\"\"", "label": 0, "label_text": "not-counterfactual"}
{"text": "The investment in owning the entire series was worth every single penny because Roberts stories are just that amazing, and always a cut above the rest!!!", "label": 0, "label_text": "not-counterfactual"}
{"text": "I wasn't as impressed with the story as I thought I would be after it being built up by a couple friends and reading of it.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The price i have found reasonable for the content.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I should have gotten a DOUBLE D but love the c way it feels", "label": 1, "label_text": "counterfactual"}
{"text": "I received it quickly and couldn't be more pleased.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It's perfect, really sturdy and well made, I just wish it came in white.", "label": 1, "label_text": "counterfactual"}
{"text": "Wish it had expandable memory .... its only con I would say", "label": 1, "label_text": "counterfactual"}
{"text": "This is a must read, and you won't want to put it down.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I do have a hard time believing that anyone could stop smoking solely based on reading a book and thought that more than a few things would be best going over within a group setting.", "label": 0, "label_text": "not-counterfactual"}
