{"text": "The top fits great just wish the bottoms fit too.", "label": 1, "label_text": "counterfactual"}
{"text": "They are a tight fit, so only consider these if you are slender.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This set is nice except for one design flaw.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This is an investment that should last me for a while.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I ordered a 14 (I would have normally ordered a 12) -- and the shorts are wonderfully comfortable, but not too stretched out even after a month of near-daily wear.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The only issue I have with them is that the legs are about an inch too long - I guess I am shorter than the mythical average person for the waist size I purchased!", "label": 0, "label_text": "not-counterfactual"}
{"text": "I just used double sided tape and it was fine.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Around $20 would have been a LOT more reasonable.", "label": 1, "label_text": "counterfactual"}
{"text": "Best part of them, besides the sound, is the INSANELY long blue tooth range; I can go over 30 feet away without any loss of sound quality.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It took a little getting used to, but now that I am used to it, I am not waking up with a aching back anymore, and have the support that I need.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The material looks and feel good and falls well.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Going back in time from the three cousins war novels this book actually is a better dramatic tale.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I haven't read in awhile I'm glad I picked this one to start!", "label": 0, "label_text": "not-counterfactual"}
{"text": "With that being said, these feel like swimwear.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The toothbrush holder had a hard time sticking to the wall and staying their until we bought new sticking pads for it now it works like a charm.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This particular curtain has a classic pattern that is subtle without being bland.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Oh, the dog has super powers, I forgot the dog must be an alien (from outer space) jeez give me a break !!", "label": 0, "label_text": "not-counterfactual"}
{"text": "Whenever My ear buds are getting uncomfortable or less than clean, I can just pop in another set.", "label": 0, "label_text": "not-counterfactual"}
{"text": "\"Newspaper usage (\\20\\\"\" instead of \\\"\"twenty\\\"\") is an amateurish sign.\"\"\"", "label": 0, "label_text": "not-counterfactual"}
{"text": "They felt like teenage pranks which she should have seen through.", "label": 0, "label_text": "not-counterfactual"}
{"text": "A nurse saw him and went to get another nurse.", "label": 0, "label_text": "not-counterfactual"}
{"text": "You skip through those and you have about 10 pages of real storyline.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The colors are lovely, but the product dimensions are off by 6 inches.", "label": 0, "label_text": "not-counterfactual"}
{"text": "So the headphones are exactly what I expected...not great, but better than most of the earbud crap that is out there.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The opening is a bit small, because of the stitching to hold the zipper in place, so it's a tight fit for the pillow.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Also the part that makes the top a mock wrap is not adjustable which makes the top look loose, it should have been adjustable.", "label": 1, "label_text": "counterfactual"}
{"text": "I know it was a free download but .....The Alix is so unlikeable and childish to the max.", "label": 0, "label_text": "not-counterfactual"}
{"text": "As the story unfolds I was so drawn into the story that I stayed up late to finish reading.", "label": 0, "label_text": "not-counterfactual"}
{"text": "• A not so single mom Susan,  who keeps connected with her significant other via you guessed it…..FB • A winner for the jerk of the year award character Paul, I would unlike him if it was possible.", "label": 0, "label_text": "not-counterfactual"}
{"text": "\"But therein is the bonus - hands-free operation in a sleek, smoothly functioning \\take-it-for-granted until it doesn't work\\\"\" piece of household equipment.\"\"\"", "label": 0, "label_text": "not-counterfactual"}
{"text": "It's a must read for anybody, even if you're not doing the Flylady!", "label": 0, "label_text": "not-counterfactual"}
{"text": "It's supposed to be worn on the back of your head, and it's adorable!", "label": 0, "label_text": "not-counterfactual"}
