{"text": "I don't know why X-Mini doesn't update their product to use micro-USB.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I have had waist trainers from other companies and have always ended up going away from using these because of the fact they make me itch and I expect I will have the same issue with this one judging from other reviews, but like other users have suggested  I will try a thin tank top underneath or good ole fashion baby powder to help control the itching which results from the sweat, that may work as well.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Good thigh space, without getting baggy in the butt or thigh.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The first fan sits in the TV room and performs extremely well without being so loud as to make understanding the television difficult.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The dress is long, however I knew it would be after reading all the reviews.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Haven't had it very long, but am loving it so far.", "label": 0, "label_text": "not-counterfactual"}
{"text": "You can read this as a standalone but to get more of Anna Zabo's goodness, read book 1 and meet Sam and Michael.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The warmer has nice little feet, which keeps it directly off any surface, but I still use a trivet, just in case.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This product will be much sturdier with a little extra bond to help the screws and dowels hold things in place.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I love being able to paint without worrying about the paper disintegrating.", "label": 0, "label_text": "not-counterfactual"}
{"text": "We know boys never really care about their underware, but these fit prefectly without being too tight or too loose in wasit, legs, and butt while helping with keeping certain items where they belong for sports purposes; therefore the teenage football player actually requested more of these for weight room and practice activites.....", "label": 0, "label_text": "not-counterfactual"}
{"text": "This was the first I have read by Ernie Lindsey and plan to read a lot more soon.", "label": 0, "label_text": "not-counterfactual"}
{"text": "My only complaint would be that it ended too soon and now I have to wait for the next installment in the story.", "label": 0, "label_text": "not-counterfactual"}
{"text": "We needed something that lays flat that he does not need to hold above the page in order to magnify.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Christian Grey....can't live with him, can't live without him!", "label": 0, "label_text": "not-counterfactual"}
{"text": "Nice thick cushion on the heel and tows, but the ribbing on the top will take some getting used to.", "label": 0, "label_text": "not-counterfactual"}
{"text": "On my WISH LIST to this and other blanket makers, I wish they'd consider making the feet area separately controlled (adjustable), or always slightly warmer.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Would be nice if the box displayed the current channel.", "label": 1, "label_text": "counterfactual"}
{"text": "I can't comment on it's true function.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I bought this sweater for myself even though it's for men (I'm a girl) and I just think it's the coolest!", "label": 0, "label_text": "not-counterfactual"}
{"text": "Things are tight, so I went with this cheaper bulb this time.", "label": 0, "label_text": "not-counterfactual"}
{"text": "IF you're buying these CD sleeves PRIMARILY FOR THE COLOR, and the image displayed here is still one of a deep, dark red (much deeper even than Santa's suit or a fire engine, but still a true red with no orange tones), and the supplying company is KFMsupply, then do NOT order these; you would be totally disappointed.", "label": 1, "label_text": "counterfactual"}
{"text": "With this I mean from their basic training with all their insecurities and faults, to the confident persons they are at the end of book one.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I haven't used it yet, but if you google Crafters Workshop Bricks with blog you will see tons of wonderful projects you can do with it.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I wish there was more about the books and less about the series.", "label": 1, "label_text": "counterfactual"}
{"text": "This is a must buy for anyone on any budjet that wants great sound and amazing noise canceling.", "label": 0, "label_text": "not-counterfactual"}
{"text": "But I had to stop somewhere in Part 3  because I was getting too annoyed.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I always enjoy a story that has a little funny, danger and sex..........", "label": 0, "label_text": "not-counterfactual"}
{"text": "I've been looking for a combination weather station that displayed barometric pressure too.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Perhaps I don't really know what noise-cancelling is.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I don't know if it was the material but it smelled like complete burnt rubber which I thought was strange.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It looked just as it does in the picture!", "label": 0, "label_text": "not-counterfactual"}
