{"text": "It's a little bit thin, but other than that it is a great wig!", "label": 0, "label_text": "not-counterfactual"}
{"text": "While I absolutely love historical novels and read them all the time, right now JUST because of the cover, I am giving it two stars, because I don't care for snakes and since I have not yet started the book, I will come back and give a better review if book is good.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I do agree that setting the stations to memory was a little difficult, but I did figure it out without reading the manual.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It was an amazing story of the adversity these men faced having to go to war.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I am going to order in two more pairs.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This little device solved a problem i was having with my speaker set up.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I will probably order a size up and see how they fit.", "label": 0, "label_text": "not-counterfactual"}
{"text": "There were also a few editing issues that I had to overcome like Greg`s name changing from Greg to Gregg and back.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The clock is fine, but a bit smaller than I wanted, from the picture it looked a bit larger, not good for a large room, but fine for small to medium size rooms", "label": 0, "label_text": "not-counterfactual"}
{"text": "You rate the product, not Amazon or the supplier here.", "label": 0, "label_text": "not-counterfactual"}
{"text": "There were a few grammar mistakes nothing to take seriously... all in all I liked the book.", "label": 0, "label_text": "not-counterfactual"}
{"text": "If the wife doesn't like it I know the girlfriend will (joking..Mmm!.", "label": 0, "label_text": "not-counterfactual"}
{"text": "They fit just right for my husky, little man.", "label": 0, "label_text": "not-counterfactual"}
{"text": "(I HAVEN'T WASHED IT YET SO COMPLAINT COULD CHANGE!!)", "label": 0, "label_text": "not-counterfactual"}
{"text": "All in all, this mount out performs my other mount that I payed 4 times as much for at Best Buy.", "label": 0, "label_text": "not-counterfactual"}
{"text": "With my Amazon prime I received this in free one day instead of the free two day for prime.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I don't think Vidal Sassoon should be in the appliance business.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Very nice quality for the price but it's a small bow like for the size of a baby.", "label": 0, "label_text": "not-counterfactual"}
{"text": "None of these boggans are as thick as the 3 older ones I already had but the ones I already had must be 7-10 years old.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I can't wait to read the next book in the Rose Harbor series!", "label": 0, "label_text": "not-counterfactual"}
{"text": "I'd be okay to read a fictious military contemporary military story, but I'd like it to be labeled what it is.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It doesn't spread out at all to form the supposed layer to prevent odors from escaping.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Just ordered two more so I can see at a glance what I've packed in my travel bags.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Did not think I was going to like this book.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The leather is smooth and supple and smells like leather, It has a trifold opening -- a third part that a license might fit into and come out more easily -- but that also opens for another card you might want to remove easily.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I want a story that flows well with believable dialogue that doesn't  read like a ten year old wrote it.", "label": 0, "label_text": "not-counterfactual"}
{"text": "All except one would only scan for a few seconds then move to the next without playing anything.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The sash doesnt come nicely tied like on the photo.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Its been a real hit and miss with our sheets (more misses than hits), but these were a solid home run.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I don't have a waster and dryer so when my clothes get home they are usually wrinkled up.", "label": 0, "label_text": "not-counterfactual"}
{"text": "SO I RECOMMEND YOU BUY BIGGER HEADPHONES ,THAT FIT COMFORTABLE BUT THE SOUND QUALITY IS GOOD, YOU GET WHAT YOU PAY FOR.", "label": 0, "label_text": "not-counterfactual"}
{"text": "So if you're wondering if you should get a few extra brushes, I highly recommend doing so, and these ones are great quality and an even better value.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I would have given it five stars but the power button is very sensitive, I'm constantly disconnecting the calls.", "label": 1, "label_text": "counterfactual"}
{"text": "PROS Cheap They work  CONS Ear fatiguing Boomy/muddy bass Harsh high frequencies  I don't like listening to these speakers, but if I weren't paying attention they would be ok.", "label": 1, "label_text": "counterfactual"}
{"text": "As mentioned in earlier reviews, make sure that the TV or monitor you want to use this with specifically supports Component-VGA - if it doesn't, then you should save your money and look for an alternative solution.", "label": 1, "label_text": "counterfactual"}
{"text": "Now, if only they would have been 'Prime' so I wouldn't have had to pay the $10 shipping!", "label": 1, "label_text": "counterfactual"}
{"text": "This book would get a solid five if only it had an index!!!", "label": 1, "label_text": "counterfactual"}
{"text": "\"I only wish that it were a little taller, to accomodate my 20\\ plus chains.\"\"\"", "label": 1, "label_text": "counterfactual"}
{"text": "Pictures had been taken and unless he sent the formulas to a certain email account the pictures would be given to the police.", "label": 1, "label_text": "counterfactual"}
{"text": "Would have been nice if it fit because it has shape to it unlike a lot that are straight and give you no shape.", "label": 1, "label_text": "counterfactual"}
{"text": "I was worried after reading some of the seller's reviews that the shirt might have run small, but that was not the case.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish there was a way to section the magazines.", "label": 1, "label_text": "counterfactual"}
{"text": "I ordered up on this top but i think i could of just ordered the 1X and would have been fine but im ok with it i dont mind if its loose i still like it", "label": 1, "label_text": "counterfactual"}
{"text": "Only thing I wish is that it came with GFI outlets, or more outlets - but I've already fixed that myself.", "label": 1, "label_text": "counterfactual"}
{"text": "The original plastic parts broke within 1 year ......I wish they would somehow design these parts better.", "label": 1, "label_text": "counterfactual"}
{"text": "The top fits great just wish the bottoms fit too.", "label": 1, "label_text": "counterfactual"}
{"text": "love the pattern of this duvet cover and so far it's held up well against a couple of washings (i hang dry it, however)  just wish that it was thicker given how expensive it is.", "label": 1, "label_text": "counterfactual"}
{"text": "It would have been helpful to have the number of rings per bag in the description--I had to go to customer reviews for this information.", "label": 1, "label_text": "counterfactual"}
{"text": "I should have read more reviews myself before buying these.", "label": 1, "label_text": "counterfactual"}
{"text": "Haven't used any comparable products, but I wish I had discovered this years ago.", "label": 1, "label_text": "counterfactual"}
{"text": "I only wish I had thought about buying one that includes readings for indoor/outdoor relative humidity and maybe even barometric pressure.", "label": 1, "label_text": "counterfactual"}
{"text": "In fact, nobody would have known they were plastic magnets had my two year old not decided it would be awesome to pull them off and stick them to random cars.", "label": 1, "label_text": "counterfactual"}
{"text": "one thing i wish it came with was some kind of case for it.", "label": 1, "label_text": "counterfactual"}
{"text": "If the seller is going to sell irregular shirts on Amazon, they should be required to state they are irregular.", "label": 1, "label_text": "counterfactual"}
{"text": "CAUTION SLIGHT SPOILERS The only complaint I have is that I wish there were more of it.", "label": 1, "label_text": "counterfactual"}
{"text": "Definitely steamy, but I wish Valdes's female characters were stronger.", "label": 1, "label_text": "counterfactual"}
{"text": "If I were going to purchase again, I would consider a synthetic bag that would not need to be washed and would be lighter.", "label": 1, "label_text": "counterfactual"}
{"text": "I should have gotten it in my own size or even a size smaller.", "label": 1, "label_text": "counterfactual"}
{"text": "I would have gone to an XL, but then the collar would have been too wide.", "label": 1, "label_text": "counterfactual"}
{"text": "Wish writers would stop making girls look like they don't know who to choose and such.", "label": 1, "label_text": "counterfactual"}
{"text": "The material is soft and breathy... wish it came in more choice of colors.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I would have shopped around but my daughter loves them so I guess thats akk that matters I just hope they dont fall apart before she wants to change her room.", "label": 1, "label_text": "counterfactual"}
{"text": "\"It was very difficult to unhook from the bracket on the wall, and I had to \\\\\\\\\\muscle\\\\\\\\\\\"\" it a little more than I would have liked to.\"\"\"", "label": 1, "label_text": "counterfactual"}
{"text": "Doesn't really complement beach photos--a sandy beige, yellow, or cyan, or any other color would have made this photo album perfect.", "label": 1, "label_text": "counterfactual"}
