{"text": "Thought it would be corny but Joanna Wylde does an excellent job at writing.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I would've preferred to get the item I ordered.", "label": 1, "label_text": "counterfactual"}
{"text": "(By the way... the sorting shoebox bookshelf thing was a nightmare for my family as well).", "label": 0, "label_text": "not-counterfactual"}
{"text": "This would be great for a realtor trying to sell a stinky house.", "label": 0, "label_text": "not-counterfactual"}
{"text": "That way you won't accidentally wake someone up if you open it at night.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Wore a pair of brown dress socks underneath, and it worked great.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Works great at the beach, outside, backyard, bicycle cruising the boardwalk...........", "label": 0, "label_text": "not-counterfactual"}
{"text": "Packaging could have been better as the feather got a little smashed on one side.", "label": 1, "label_text": "counterfactual"}
{"text": "I ordered it for my sister (who is Plus size) and I can't even wear it, it is so small.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I had to find out if Tartt had fixed her problems and so I read it on my Kindle (Ha!)", "label": 0, "label_text": "not-counterfactual"}
{"text": "My husband got it going for me, and I just unplug instead of try to turn it on with the little knob.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It took almost a month to get this suit in!", "label": 0, "label_text": "not-counterfactual"}
{"text": "The lessons and thoughts of Donald Maass are hardcore for writers that want to create page turners, and the key is building relentless tension on just about every page.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It came with some nicks and a displaced panel, but i fixed it.", "label": 0, "label_text": "not-counterfactual"}
{"text": "We feel at ease when it comes to this smart device.", "label": 0, "label_text": "not-counterfactual"}
{"text": "However, despite this major flaw, I really loved the two main characters and how they were both complete hot messes.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Her ex- husband takes the boys regularly, so she has time for some adult fun.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The reader gets all three of them in this book!", "label": 0, "label_text": "not-counterfactual"}
{"text": "Also the sound quality when you play your MP3 player through the speaker isn't any better than adequate.", "label": 0, "label_text": "not-counterfactual"}
{"text": "the hood is made out of the same material as the shirt...its tight", "label": 0, "label_text": "not-counterfactual"}
{"text": "In this series everything goes absolutely right, no problem insurmountable.Just not that great a read.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This little device solved a problem i was having with my speaker set up.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I know it was a free download but .....The Alix is so unlikeable and childish to the max.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I could have probably ordered the extra small but I am happy with the small, just a little wiggle room.", "label": 1, "label_text": "counterfactual"}
{"text": "It's not going to win any awards for beauty, but if you want a cheap solution to hide what's under the bed, this bed skirt is the one for you.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Good quality curtains, blocks out light great, came in fast.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Description of scenes were well done and you knew the characters without physical descriptions being necessary as you knew their inner beings.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This would be PERFECT if there was a drawstring around the hood.", "label": 0, "label_text": "not-counterfactual"}
{"text": "We love our Bichon and wanted to be able to share a little of their bubbly spirit when we send letters.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Great story, I started reading it and couldn't put it down, went through all 4 parts at once.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Sometimes I get the characters confused, but then I am old.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It would have been perfect otherwise; lightweight, easy to clean, easy to dry...but not nearly as effective as it could be.", "label": 1, "label_text": "counterfactual"}
