{"text": "With the writers experience it could should have been more than what it turned out to be.", "label": 1, "label_text": "counterfactual"}
{"text": "However, people come to me about his books, and they must remember this is fiction and the organizations he uses in the stories have nothing to do in these type of dealings.", "label": 0, "label_text": "not-counterfactual"}
{"text": "i probably have 6 sets of skullcandy headphones and love them.", "label": 0, "label_text": "not-counterfactual"}
{"text": "There's also a lot of history about this war that's going on, and Mira's personal history which plays an integral role in everything.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Love the T. Look forward to buying more from you all.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I haven't bought a pair of Levi's since I was in High School, you know, back when the earth was cooling; I shopped carefully at Amazon, went only to Levi's, read all the product descriptions regarding fit and rise, ordered and held my breath.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I wish there was another book to continue telling the story.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This mattress attachment that is wider than the small upholstery attachment makes cleaning sofas and even floor much quicker.", "label": 0, "label_text": "not-counterfactual"}
{"text": "We have seen others in the facility with the same one on, so they must be popular.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This vacuum is a very noble machine, I beat the heck out of it and it keeps cleaning!", "label": 0, "label_text": "not-counterfactual"}
{"text": "Unless I laminate them, they won't last long.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I think her choice was more emotional to not but I would have returned for something else as I was not satisfied with quality to be added to the bracelet.", "label": 1, "label_text": "counterfactual"}
{"text": "I have the humidifier which works very well, and we haven't had any trouble with it, but I sure wish the price would go down!", "label": 0, "label_text": "not-counterfactual"}
{"text": "These sheets are so thin you can almost see through the flat sheet.", "label": 0, "label_text": "not-counterfactual"}
{"text": "What should I say about To Kill a mocking bird.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I bought these sheets for my son last year.", "label": 0, "label_text": "not-counterfactual"}
{"text": "was to small, so order a larger size if you have a nice butt like i have they wont fit.", "label": 0, "label_text": "not-counterfactual"}
{"text": "However, I think it would be better if you read her books in order as the stories kind of build on each other.", "label": 1, "label_text": "counterfactual"}
{"text": "This boxwood wreath (ordered the 12 inch) is just what I was searching for at a more reasonable price than MANY other sites; (other sites that I researched ranged from $90.00 to $120.00 for the same size boxwood).", "label": 0, "label_text": "not-counterfactual"}
{"text": "Buttons are opposite of how they should be according to the package & instructions.", "label": 0, "label_text": "not-counterfactual"}
{"text": "A few reviews said the cloth ear pads help keep your ear cooler.", "label": 0, "label_text": "not-counterfactual"}
{"text": "They are very pretty, and I would purchase again.", "label": 0, "label_text": "not-counterfactual"}
{"text": "\"If you're worried about compatibility, this \\snaps\\\"\" into every plate HD/LW sells.\"\"\"", "label": 0, "label_text": "not-counterfactual"}
{"text": "\"I use an old smartphone as a \\radio\\\"\" that I have permanently paired with the speaker, and I love how the speaker does indeed stay paired even if the phone goes into sleep mode (another cheaper speaker I tried didn't do that and it was super frustrating to have to go to the speaker and restart it's bluetooth pairing).\"\"\"", "label": 0, "label_text": "not-counterfactual"}
{"text": "I have had waist trainers from other companies and have always ended up going away from using these because of the fact they make me itch and I expect I will have the same issue with this one judging from other reviews, but like other users have suggested  I will try a thin tank top underneath or good ole fashion baby powder to help control the itching which results from the sweat, that may work as well.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I loved the comforter but was a little disappointed that the sheets where white instead of dark blue.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It folds up nicely and can be stored flat.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It was really hard to like Harrison, although I wanted to!", "label": 0, "label_text": "not-counterfactual"}
{"text": "I liked it enough that I already have downloaded the next one.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Take it everywhere i go and has saved me a few times.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I wonder if they realize that vac's usually have a safety mechanism that shuts a unit off when the filter gets too clogged up!", "label": 0, "label_text": "not-counterfactual"}
{"text": "While I am missing out on a good signal on one or two smaller stations, it pulls in all of the other stations strongly with no dropouts whatsoever in the digital signal.", "label": 0, "label_text": "not-counterfactual"}
