{"text": "The only downside is my laptop does not have the screw holes on it and the screws do not retract far enough back for me to push the connector all the way in, but a simple smash will rid that issue (this thing is durable!)", "label": 0, "label_text": "not-counterfactual"}
{"text": "Wore a pair of brown dress socks underneath, and it worked great.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Yep, they're expensive, but I won't buy another brand for my hoodies.", "label": 0, "label_text": "not-counterfactual"}
{"text": "As I started reading I found I was so engrossed in the book I just couldn't put it down, until it started to all get a little confusing.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It hits slightly past the hips on me, but I am short!", "label": 0, "label_text": "not-counterfactual"}
{"text": "I am a size 12  mnemonic d I got a 2x and it kept rolling down on my stomach so I assumed its to small so order way bigger then what you need other wise the construction of it was not bad but when I pull the strap to snap it sounds as if it was ripping but I would buy it again from seller on a bigger size order came vin 3 days", "label": 0, "label_text": "not-counterfactual"}
{"text": "Loved the twists and turns...even though it is a lengthy book, I never lost interest.", "label": 0, "label_text": "not-counterfactual"}
{"text": "My husband will be living in this in the winter!", "label": 0, "label_text": "not-counterfactual"}
{"text": "I am going to read the send book next.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I have not washed it yet because I'm afraid it will fall apart in the machine.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It's a good mask, but it was cracked when I received it", "label": 0, "label_text": "not-counterfactual"}
{"text": "A few reviews said the cloth ear pads help keep your ear cooler.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The reason I did not like them is that the size is really weird, they are kind of short... so the waist hardly goes up from the hips.", "label": 0, "label_text": "not-counterfactual"}
{"text": "She's not happy with Zack going but knows he must.", "label": 0, "label_text": "not-counterfactual"}
{"text": "If you need FM radio for the machines in the gym, Apple requires you to buy a $50 adapter and to have another three feet of cord hanging off you.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This is the most stunning mirror I have ever seen!", "label": 0, "label_text": "not-counterfactual"}
{"text": "By the way, it comes with a tres chique little black belt which I adore!", "label": 0, "label_text": "not-counterfactual"}
{"text": "The other is I think there's a little too much bass but maybe I just couldn't hear it before because I was using apple ear buds.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It does not just talk about the theory behind the topic but offers simple steps to exercise the principles and become a happier more content and productive  person both in your private as well as your professional life.", "label": 0, "label_text": "not-counterfactual"}
{"text": "(I bought one for myself and for my husband.)", "label": 0, "label_text": "not-counterfactual"}
{"text": "You will love this book wrote just right!!!", "label": 0, "label_text": "not-counterfactual"}
{"text": "To return is a pain so Basically I'm out the money and still need to purchase something else to hand my clothes.", "label": 0, "label_text": "not-counterfactual"}
{"text": "They work well enough to listen to the radio.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The product was easy to assemble, but when we went to mount the TV, the screws sent were incorrect and we had to do a Radio Shack run... make sure you have a inferred to pull the signal behind the TV!", "label": 0, "label_text": "not-counterfactual"}
{"text": "What I love about this book is the character development.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Probably most devices don't have super high tolerances but this light has a machined steel tube fitting the batteries precisely so the extra thickness of the label on these causes a problem.", "label": 0, "label_text": "not-counterfactual"}
{"text": "You jewelry will take less space when you store that without this organizer.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I haven't had them for a long enough to see how they wear.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Fits the bill in a pinch, but not my favorite.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It fit POORLY<g> but it did come on and come off without rips, tears or bulging seams.", "label": 0, "label_text": "not-counterfactual"}
{"text": "exactly what my friend wanted for her bday was mickey mouse....and she loved this piece.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I originally purchased this for my teen daughter but I began to read and I couldn't stop.", "label": 0, "label_text": "not-counterfactual"}
{"text": "These would have been perfect if the fit was right.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish, whoever submitted the images should have created a vector based image which would maintain the clarity with the changing aspect ratios or image sizes.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish it were a closer pix , but I love it the same.", "label": 1, "label_text": "counterfactual"}
{"text": "All she knows is that she can trust no one and that she must find her brother if he is still alive.", "label": 1, "label_text": "counterfactual"}
{"text": "They got me to a place in minutes that would have taken hours for me to get.", "label": 1, "label_text": "counterfactual"}
{"text": "No issues, except it would have been great if they had a locking mechanism to lock down the grips, like vise grips do, but the width of the handles was small enough that even my small hands could still hold the grip and the 100% stretch.", "label": 1, "label_text": "counterfactual"}
{"text": "If you can get by without tech support this is the type of ereader  to purchase.", "label": 1, "label_text": "counterfactual"}
{"text": "if it was possible to give this book -1,000,000 stars I would I hate this book boys that are like 12 might like it but I hate it so much nothing new happens every one dies in the end just like every other book I've read I hate this book and you should not read it I DO NOT RECOMMEND THIS STUPID, DUMB, BORING BOOK", "label": 1, "label_text": "counterfactual"}
{"text": "It would have been helpful to have the number of rings per bag in the description--I had to go to customer reviews for this information.", "label": 1, "label_text": "counterfactual"}
{"text": "This book would get a solid five if only it had an index!!!", "label": 1, "label_text": "counterfactual"}
{"text": "I like the shorts and the details on it, but I wish it was a little longer because my thighs are a bit much for it.", "label": 1, "label_text": "counterfactual"}
{"text": "That would have cost more than I paid for the costume so I decided to go with the refund.", "label": 1, "label_text": "counterfactual"}
{"text": "I should have listened to the majority of the reviews that I read prior to buying it.", "label": 1, "label_text": "counterfactual"}
{"text": "Not sure if I had been heavier or taller if it would have worked out.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish there was more about the books and less about the series.", "label": 1, "label_text": "counterfactual"}
{"text": "I liked the storyline but I just would have like to have seen a little bit more.", "label": 1, "label_text": "counterfactual"}
{"text": "Until June I would have given it 5 stars.. but this failure now gives it a bad review", "label": 1, "label_text": "counterfactual"}
{"text": "I think I would have been happier with the print version, and that's no fault of the actual content.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I would've known that the projection is on a 16 hour timer and turns off automatically.", "label": 1, "label_text": "counterfactual"}
{"text": "I like these for stitch markers but wish you'd carry the 1 inch size.", "label": 1, "label_text": "counterfactual"}
{"text": "Also the cargo pockets could have been made larger.", "label": 1, "label_text": "counterfactual"}
{"text": "Would have been better with embroidery Great safety color when riding motorcycle.", "label": 1, "label_text": "counterfactual"}
{"text": "think this book would have been better is there was a cut from the main female and allowed the reader to learn more about what was going on through the main male character, because maybe then you would have to read how excited Ana was just to see Athen or how excited she was to be apart of a family now.", "label": 1, "label_text": "counterfactual"}
{"text": "I would have given this Crucifix five stars, but there is an obvious typographical error in the sign which hangs above Jesus' figure.", "label": 1, "label_text": "counterfactual"}
{"text": "Definitely get me through the day, but wish the seat covered higher.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I could have used this head set but the day I received it it wouldn't even turn on and I really wanted this product to work I'm very disappointed.", "label": 1, "label_text": "counterfactual"}
{"text": "Would have been 5 stars if the commands were easy to produce every time you use it.", "label": 1, "label_text": "counterfactual"}
{"text": "beautiful jacked however i should have picked a bigger size.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I had found this before I took the MCAT for the first time.", "label": 1, "label_text": "counterfactual"}
{"text": "Liked the color & style, wish it was just more stretchy for more roomy & comfy, but over all happy with purchase.", "label": 1, "label_text": "counterfactual"}
{"text": "I really enjoyed this book and was glad that we got more story after where toxic left.. the only thing I wish we would have had a epiloge in this book to know what happened with Nathan and Logan.. but I also feel maybe you could do a 3rd book in both their POV's on what is next for them!", "label": 1, "label_text": "counterfactual"}
{"text": "I think if the author takes a lot of time and work and edits the crap out of this thing it could be a fun book.", "label": 1, "label_text": "counterfactual"}
