{"text": "However, I used these to burn my own music and the songs would skip on many cd players.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I thoroughly enjoyed this book - I couldn't put it down once it began.", "label": 0, "label_text": "not-counterfactual"}
{"text": "What I didn't expect was that the white material would have a slight sheen to it.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This took out the red dye from a white shirt.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I wouldn't use this in a layout for my scrapbook and it's sort of bulky, but I bought it to make cards with.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The writing is pretty dry and contains rather too much of the clinical minutiae of the 'how we looked for the answers' and not enough insight.", "label": 0, "label_text": "not-counterfactual"}
{"text": "You would be a fool to buy any other Bluetooth speaker.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The only thing I will criticize is the color is not exactly as shown.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Except for the zipper being itchy (had to wear a band-aid underneath the zipper) this dress was PERFECT for when I had to dress up as Twilight Sparkle for a Mardi Gras parade.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It looks good, but when you remove the plastic on both sides its very clear and looks like glass.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Please, the ipod doesn't sound THAT much better than the SanDisk.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The characters are wonderful and the story is very well written.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It's not dreadlocks like it shows in the picture .", "label": 0, "label_text": "not-counterfactual"}
{"text": "It's a tough book to read at times.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I worried that it would be cheap or not fit or...whatever...But WOW!", "label": 0, "label_text": "not-counterfactual"}
{"text": "I purchased two Sony Radio Clock they had dead batteries in both of them which are hard to find for they are not the typical radio battery.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Couldn't find one at any department stores wasn't sure if it would fit seeing it was a gift.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Bought it for my daughter and she loves it.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Easily understood even by those without much knowledge in Japanese cooking or foods.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I can't say much more without spoiling it.", "label": 0, "label_text": "not-counterfactual"}
{"text": "That is a complete farce and who would be prepared to even entertain the idea of ordering if you are taller than normal (and you CAN'T let down cotton twill fabric without crease marks showing).", "label": 0, "label_text": "not-counterfactual"}
{"text": "However, the fabric is not that great, it's cheap scratchy cotton.", "label": 0, "label_text": "not-counterfactual"}
{"text": "These boxer-briefs are very soft, very comfortable, and fit like high-end underwear the likes of which you might get at, oh, say, Calvin Klein for example, but for about half the price.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The scarf was soft and matched beautifully but we gave the hats away because they were TINY.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This book was a great start to a new series!", "label": 0, "label_text": "not-counterfactual"}
{"text": "It's also made of entirely plastic and may seem a little flimsy but it seems to stick in our window fine using the gooey disc that came with it.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This holds a charge over 3-4 times as long as others.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Hopes that it will keep it's shape after washing.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The book had some interesting twists that I did see coming and I look forward to reading part two of this series.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The sheets...maybe a different seller...CHEAPLY made and silky again...they won't stay tucked into the mattress.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I read the size instructions but it was smaller than it said.", "label": 0, "label_text": "not-counterfactual"}
{"text": "He doesn’t believe those who hold him will ask for ransom and it is not his style to pay ransom although he might give in this time.", "label": 0, "label_text": "not-counterfactual"}
{"text": "#NAME?", "label": 0, "label_text": "not-counterfactual"}
{"text": "\"The crossover from the characters from one novel to others keeps me interested; after all, I do hate to miss a \\Dee-Ann or Eggie\\\"\" appearance.\"\"\"", "label": 0, "label_text": "not-counterfactual"}
{"text": "The only downside is my laptop does not have the screw holes on it and the screws do not retract far enough back for me to push the connector all the way in, but a simple smash will rid that issue (this thing is durable!)", "label": 0, "label_text": "not-counterfactual"}
{"text": "I can pick up calls during my run and converse without any issues with the audio.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It's great quality, it's not all plastic like some machines.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Its been a real hit and miss with our sheets (more misses than hits), but these were a solid home run.", "label": 0, "label_text": "not-counterfactual"}
{"text": "They ran the first time I put them on.", "label": 0, "label_text": "not-counterfactual"}
{"text": "\"It also validates \\\\\\\\\\the incorrect\\\\\\\\\\\"\" assumption that we are alone in the feelings we suppress when we sense the complete garbage that is thrown out into society.\"\"\"", "label": 0, "label_text": "not-counterfactual"}
{"text": "Won't look quite as matronly if I can expose my calves just a tad!", "label": 0, "label_text": "not-counterfactual"}
{"text": "A few reviews said the cloth ear pads help keep your ear cooler.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The book was amazing it definitely was a eye keeper I couldn't put it down read the whole book in two days and I can't wait to download more books on my kindle from the author !!", "label": 0, "label_text": "not-counterfactual"}
{"text": "As the story unfolds I was so drawn into the story that I stayed up late to finish reading.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The cable has the look and feel of quality.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I love the organic cotton but I wish these weren't so expensive!", "label": 0, "label_text": "not-counterfactual"}
{"text": "All sizes were good except the carry on and suitcase size couldn't figure out how to use those as there is no place for vacuum Good price", "label": 0, "label_text": "not-counterfactual"}
{"text": "You have to read the book to find out.", "label": 0, "label_text": "not-counterfactual"}
{"text": "That said, this cable worked well for what i needed it for and because it was delivered ahead of time and is doing a great job without fail, I am giving it five stars!", "label": 0, "label_text": "not-counterfactual"}
{"text": "\"This story was so riveting and drew me in by the first chapter...I have most recently been a fan of dystopian, apocalypse, zombie apocalypse then beautiful creatures novels...this was my second \\\\\\\\\\paranormal haunting\\\\\\\\\\\"\" book and I am hooked.\"\"\"", "label": 0, "label_text": "not-counterfactual"}
{"text": "I wear a large and was hoping the dress would fit because I love the material, the color and the look.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It doesn't hang right, I have to put myself in an uncomfortable position to get the light to shine in the right spot.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Like I said, the story was cute it just left this reader wishing for more development.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This does exactly what I wanted it to do and would consider getting more for the other doors.", "label": 0, "label_text": "not-counterfactual"}
{"text": "You're only shot is using the buttons at the back of the unit and forgoing the software and it's supposed customization.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I do drawing as a past time and thiis is filled with all that I could possibly need.", "label": 0, "label_text": "not-counterfactual"}
{"text": "After finishing this book, I am seriously in love with Landon.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I have had earphones that quit after a month.", "label": 0, "label_text": "not-counterfactual"}
{"text": "She had such a pure spirit and all she wanted from life was love and it’s so sad that it wasn’t to be for her.", "label": 0, "label_text": "not-counterfactual"}
{"text": "At first, I couldn't figure out the 'why' behind the title.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I haven't used them yet so will probably update my review once I do.", "label": 0, "label_text": "not-counterfactual"}
{"text": "IF YOU DO READ ANYWAY I CAN'T BE HELD RESPONSIBLE FOR ANY DISAPPOINTMENT OR HARDSHIP YOU SUFFER IN RELATION TO THE REVELATIONS HEREIN.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This shirt is super cute, well made and I got it on sale!!", "label": 0, "label_text": "not-counterfactual"}
{"text": "One other really bad thing is it doesn't have auto shut off.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It occurs to me that the book could have been split into three different books and still have the same impact.", "label": 1, "label_text": "counterfactual"}
{"text": "The blanket is nice and soft but it is white, so if it doesn't light up it isn't much use!", "label": 1, "label_text": "counterfactual"}
{"text": "No issues, except it would have been great if they had a locking mechanism to lock down the grips, like vise grips do, but the width of the handles was small enough that even my small hands could still hold the grip and the 100% stretch.", "label": 1, "label_text": "counterfactual"}
{"text": "While this should have been exactly what I needed, the converter is very intermittent.", "label": 1, "label_text": "counterfactual"}
{"text": "i wish the storage compartment was a little bigger and opened up instead of slidding on and off.", "label": 1, "label_text": "counterfactual"}
{"text": "If directions were provided, 5 out of 5 would be the obvious review.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish i would have thought about that before buying the item but that's okay.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish there was more variety in the designs available for this size but nonetheless I am happy with it, and it allowed me to show two different poses on each side of the frame.", "label": 1, "label_text": "counterfactual"}
{"text": "Could be used as an ornament at Christmas or to hang in the car.", "label": 1, "label_text": "counterfactual"}
{"text": "I gave this story four-stars when in reality I might have only given it three and a half just because Emma's character started to annoy me very quickly and the going back and forth between the past and present every chapter (which, by the way, I found were too short) made it hard to keep up with the story if you didn't read it in a longer sitting.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I had had him as an instructor at college.", "label": 1, "label_text": "counterfactual"}
{"text": "I just wish it was available in a larger size!!", "label": 1, "label_text": "counterfactual"}
{"text": "They got me to a place in minutes that would have taken hours for me to get.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I had read the reviews before I bought it.", "label": 1, "label_text": "counterfactual"}
{"text": "Otherwise they're fine, although I think for the imperfections they could have been discounted more.", "label": 1, "label_text": "counterfactual"}
{"text": "The designs are easy, even if they appear complex, so it would be a decent project for a beginner.", "label": 1, "label_text": "counterfactual"}
{"text": "It's perfect, really sturdy and well made, I just wish it came in white.", "label": 1, "label_text": "counterfactual"}
{"text": "\"\\\\\\\\\\Had I reviewed this immediately I would have given this product five stars because It worked.\"\"\"", "label": 1, "label_text": "counterfactual"}
{"text": "did not work very long, not worth the money at all...i should have sent them back.", "label": 1, "label_text": "counterfactual"}
{"text": "I just wish we had more of a selection in tall sizes.", "label": 1, "label_text": "counterfactual"}
{"text": "I love the pencil skirt it fit me perfect, i wish they had them in other colors very nice for sure", "label": 1, "label_text": "counterfactual"}
{"text": "And it fits just as i would've wanted it to.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish we could have found something a little more kick a** girly but these are great.", "label": 1, "label_text": "counterfactual"}
{"text": "I would have liked to exchange for another size, but the larger size was not available.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish it were a little shorter since she is too little to reach inside...I have to turn it on its side for her to get her toys.", "label": 1, "label_text": "counterfactual"}
{"text": "I would have been willing to put up with the room in the cup were it not for the fact that the band going under my arm went up way too high and caused chafing in my underarm.", "label": 1, "label_text": "counterfactual"}
{"text": "Probably would have enjoyed more if I hadn't spent so much focus on tracking placement in the book.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish it was longer for my own personal enjoyment and while I wait for the next I'm sure I'll reread it 5 times over!!", "label": 1, "label_text": "counterfactual"}
{"text": "Horrible don't waste your money, wish I bought the paper back!", "label": 1, "label_text": "counterfactual"}
{"text": "Wish the elastic was a little more forgiving... but other than that I love them!", "label": 1, "label_text": "counterfactual"}
{"text": "Maybe I got a deffective hamper, but I had to return it because it had a big rip at the bottom and I could tell that even if that rip wasn't there, I doubt it would have hold a lot of clothes.", "label": 1, "label_text": "counterfactual"}
{"text": "However it would have cost over $7.00 to return them so I am going to keep them but won't buyfrom you again.", "label": 1, "label_text": "counterfactual"}
{"text": "Good story too, felt like it could have been real and with a historical setting that added more to the undercurrent of social comment than to the actual storyline of this compelling mystery.", "label": 1, "label_text": "counterfactual"}
{"text": "There were several tantalizing directions I could have seen the story moving into, but it never did.", "label": 1, "label_text": "counterfactual"}
{"text": "Wish I could cause I would love to know about Ruby's new adventure.", "label": 1, "label_text": "counterfactual"}
{"text": "I WOULD BUY MORE IN THE FUTURE FOR MY OWN REAL TREE.", "label": 1, "label_text": "counterfactual"}
{"text": "I would have liked the case to have been aluminum instead of the cheap plastic.", "label": 1, "label_text": "counterfactual"}
{"text": "\"But oddly enough, the bottoms are a little too loose in the waist (37\\) and could have used another inch or two in the inseam ( I normally take a 35\\\"\" or 36\\\"\" in jeans, depending on the brand if this helps).\"\"\"", "label": 1, "label_text": "counterfactual"}
{"text": "I should have listened to the majority of the reviews that I read prior to buying it.", "label": 1, "label_text": "counterfactual"}
{"text": "Wish it would have come with some extra lanterns because we put a hole in one of them.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish there were a way to return e-books.", "label": 1, "label_text": "counterfactual"}
{"text": "It is easy to charge too but I wish the cord was a little bit longer.", "label": 1, "label_text": "counterfactual"}
{"text": "Had hoped that my item was New and unused but after visiting their return page, I wonder if it was a trade in item?", "label": 1, "label_text": "counterfactual"}
{"text": "I'm usually a Size 10.. i think I should have went up a size.", "label": 1, "label_text": "counterfactual"}
{"text": "These are easy to put on when straight out of the package but wish there were an easier way to pack them back up.", "label": 1, "label_text": "counterfactual"}
{"text": "If it had a weighted bottom I would have given it 4/5 stars.", "label": 1, "label_text": "counterfactual"}
{"text": "If the can redesign the sleeves, even if it means less pages in the binder, it would be 5 stars.", "label": 1, "label_text": "counterfactual"}
{"text": "As others have noted, it would have been nice if this came in a 14-pair set as that is what is needed for a 7.1 speaker setup.", "label": 1, "label_text": "counterfactual"}
{"text": "it needs more book in it and less about the author I wish it had more book in it ok", "label": 1, "label_text": "counterfactual"}
{"text": "Those kind of things should be caught in the editing process but they weren't.", "label": 1, "label_text": "counterfactual"}
{"text": "Definitely get me through the day, but wish the seat covered higher.", "label": 1, "label_text": "counterfactual"}
{"text": "These would have been perfect if the fit was right.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish it were more faster and less dialogue in the girl's head.", "label": 1, "label_text": "counterfactual"}
{"text": "I thought I would be able to smell these on my desk at work and it did not smell at all", "label": 1, "label_text": "counterfactual"}
{"text": "It would have been nice to have the HDMI connection on this unit like the Archos TV unit possesses.", "label": 1, "label_text": "counterfactual"}
{"text": "It would be too hard to get the top, bottom and edges of the walls if it didn't bend.", "label": 1, "label_text": "counterfactual"}
{"text": "I got a defective product and was told to not waste my time trying to get an exchange through them and go to the Apple Store which is what I should have done in the first place and not given them my money.", "label": 1, "label_text": "counterfactual"}
{"text": "Though, I'm not one to get too upset by such things myself,  I do get why other people might have been upset by the liberties the movie took.", "label": 1, "label_text": "counterfactual"}
{"text": "if it had bad quality but good service that could have bumped the rating up a notch, but even the service is disappointing!", "label": 1, "label_text": "counterfactual"}
{"text": "(A bigger size would have gone very high on my calf.)", "label": 1, "label_text": "counterfactual"}
{"text": "No extras-even FM radio would have been a nice touch.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I had been like her when I was 19-20.", "label": 1, "label_text": "counterfactual"}
{"text": "That would have cost more than I paid for the costume so I decided to go with the refund.", "label": 1, "label_text": "counterfactual"}
{"text": "This extension cable works perfectly, just wish it wasn't as expensive as it is (you can get HDMI cables for cheaper than this these days).", "label": 1, "label_text": "counterfactual"}
