{"text": "You hear it every time you turn your head around.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The tab could have been a quarter inch longer.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I feel that Kara has a habit of making bad life choices, a new relationship in the book really annoys me, and I wasn't a fan of the genre swap to High Fantasy.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Sheets that came with it didn't match bedding.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The leather is smooth and supple and smells like leather, It has a trifold opening -- a third part that a license might fit into and come out more easily -- but that also opens for another card you might want to remove easily.", "label": 0, "label_text": "not-counterfactual"}
{"text": "They hold up well and still look great after lots of washing.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I wasn't too impressed with the 160 gram twin bed sheets I bought for my kids, shed and pilled like crazy.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I agree with the other reviews that this book is an excellent source for an introduction and explanation into BDSM, without all the dither of 50 Shades type books.", "label": 0, "label_text": "not-counterfactual"}
{"text": "There were one or two spots where the whole agonizing over confessing emotions was a tiny bit much even for me, but that could be a preference thing.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It's a huge disappointment that Sonos doesn't offer AirPlay support.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I'm sad to see the series end, but Towle hit it out of the park with this book.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Like I said, the story was cute it just left this reader wishing for more development.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I love my FilterQueen Vacume but wanted the floor tool to use instead of the power head.", "label": 0, "label_text": "not-counterfactual"}
{"text": "the rubber seals are dried and hard and do not seal properly.", "label": 0, "label_text": "not-counterfactual"}
{"text": "\"It works, but it did disable my \\eco\\\"\" mode setting.\"\"\"", "label": 0, "label_text": "not-counterfactual"}
{"text": "Works as wipe tied and came with a nice instruction booklet with info on programming it for all my devices.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Those are the readers that won't understand this book.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I know James didn't hire her but crap!", "label": 0, "label_text": "not-counterfactual"}
{"text": "There isn't much to say except that it arrived promptly and works.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I just couldn't put it down.. till my kindle died and I had to..", "label": 0, "label_text": "not-counterfactual"}
{"text": "I love that it came with the AC adapter and I did not have to send away for it and spend extra money for what I consider to be a necessity to save on battery costs.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I am very happy and so are those I bought them for!!", "label": 0, "label_text": "not-counterfactual"}
{"text": "The neckline is pretty low cut, but you can adjust the straps so that it's not showing anything above your bra...which leads me to what I dislike.", "label": 0, "label_text": "not-counterfactual"}
{"text": "A fantastic product, though not for other rechargeable batteries.", "label": 0, "label_text": "not-counterfactual"}
{"text": "With quick regular vacuuming around the cat boxes after litter clean up has made a difference in my home.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I got it because it was free, and although I don't really care for Romance or Erotica (which seems an apt genre listing) I found myself incredibly interested in the world that Charles has created.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The fabric was great, lined and perfect for little girls.", "label": 0, "label_text": "not-counterfactual"}
{"text": "\"I was hoping when I got to the end there would be a surprise and it was all worth it... there was a surprise ending but nothing that made me say \\wow.\\\"\"\"\"\"", "label": 0, "label_text": "not-counterfactual"}
{"text": "The size of the pillow is great, your pillowcases won't swallow it up.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Couldn't find one at any department stores wasn't sure if it would fit seeing it was a gift.", "label": 0, "label_text": "not-counterfactual"}
{"text": "\"Considering how Jacob demands he change clothes, \\plate the charcuterie and cheese,\\\"\" and take out the garbage all in the same scene while Sam is upset with the impending party it would seem like Sam also has a problem with being bossed around but doesn't really.\"\"\"", "label": 0, "label_text": "not-counterfactual"}
{"text": "I've been wanting headphones for a long time, but I can't bring myself to leave the frequency these have to offer.", "label": 0, "label_text": "not-counterfactual"}
{"text": "We have to return for larger size if it is available.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Now bouncing back and forth across the country leaves me without it on occasion.", "label": 0, "label_text": "not-counterfactual"}
{"text": "There was plenty of excitement and you learn that sometimes things aren't really what they seem and people are mulit-dimensional, not always single minded.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I got this after taking a Reiki class because it was an easy way to have the symbols in front of your face without dealing with pages.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I just wanted to split my video out from my computer to a monitor and a HDTV.", "label": 0, "label_text": "not-counterfactual"}
{"text": "A lot of money but we feel it was worth it.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Not bad but the belt color for faded after sometime.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Looks great love it a little lose on the breast area", "label": 0, "label_text": "not-counterfactual"}
{"text": "This is an amazing device, for it size it packs in some serious punch.", "label": 0, "label_text": "not-counterfactual"}
{"text": "A little different from what am used to read.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I am quite happy with this product, and am considering getting one for the bathroom..for extra storage of things there.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This silk coverlet is very expensive, but so beautiful.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This being said:  give it a good 40 to 50 hour burn-in time.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The stories are good not great; the characters familiar.", "label": 0, "label_text": "not-counterfactual"}
{"text": "No surprises here, what you see is what you get.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Comes with a good assortment of colors (18, 3 of each color).", "label": 0, "label_text": "not-counterfactual"}
{"text": "I was able to return the bulb and received back payment without issue.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Great to read a historical based fiction that captures my imagination.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It could be so it can charge faster but I do not know for sure.", "label": 0, "label_text": "not-counterfactual"}
{"text": "If you want a book that holds you captive, this is a must.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I like the idea of it, but it doesn't stay in place.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Love Blevins told a story that would be an excellent movie or series.", "label": 0, "label_text": "not-counterfactual"}
{"text": "What she doesn't count on is meeting Tanner and falling in love.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I tried them all, and they all work great!", "label": 0, "label_text": "not-counterfactual"}
{"text": "It fits perfect and was decent quality for this price!", "label": 0, "label_text": "not-counterfactual"}
{"text": "Very soft on the inside, but no good to me because I couldn't comfortably fit in them!", "label": 0, "label_text": "not-counterfactual"}
{"text": "This jersey like crew neck is really cool!!", "label": 0, "label_text": "not-counterfactual"}
{"text": "I've have bought all sorts of different ear bud headsets and they just don't stay put and I was constantly adjusting them during my ride.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The fan speed is a bit slower than I though it could be.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This seat cover is something I thought only the elderly would buy.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Doesn't wrap around the front at all either, like the other reviews mentioned, but I really like it!", "label": 0, "label_text": "not-counterfactual"}
{"text": "I hate to say goodbye to these characters and I can tell Quinn Loftis doesn't want to either!", "label": 0, "label_text": "not-counterfactual"}
{"text": "Moreover, this work is in the public domain anyway and should have been copyright free, hence $0.", "label": 1, "label_text": "counterfactual"}
{"text": "If the seller is going to sell irregular shirts on Amazon, they should be required to state they are irregular.", "label": 1, "label_text": "counterfactual"}
{"text": "I could never have guessed the ending, but it was a great ending!", "label": 1, "label_text": "counterfactual"}
{"text": "It has the same great comfortable & flattering features plus the great denim texture that Lee has perfected- smoothing and stretchy without the excessive cling- but I think it must have been designed for people who have a greater surplus of belly fat than I.", "label": 1, "label_text": "counterfactual"}
{"text": "Only wish I could find the matching curtains mentioned in the description but haven't been able to find them anywhere :(", "label": 1, "label_text": "counterfactual"}
{"text": "Ending could have been a little stronger but it was a fabulous read.", "label": 1, "label_text": "counterfactual"}
{"text": "I should have listened to all the people who posted reviews.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I had read the reviews before I bought it.", "label": 1, "label_text": "counterfactual"}
{"text": "I could have probably ordered the extra small but I am happy with the small, just a little wiggle room.", "label": 1, "label_text": "counterfactual"}
{"text": "Wish I would mix and match the top and bottom with different sizes.", "label": 1, "label_text": "counterfactual"}
{"text": "I like the shorts and the details on it, but I wish it was a little longer because my thighs are a bit much for it.", "label": 1, "label_text": "counterfactual"}
{"text": "I ordered up on this top but i think i could of just ordered the 1X and would have been fine but im ok with it i dont mind if its loose i still like it", "label": 1, "label_text": "counterfactual"}
{"text": "Wish the shipping was cheaper, but definitely worth the extra couple bucks, great purchase!", "label": 1, "label_text": "counterfactual"}
{"text": "did not work very long, not worth the money at all...i should have sent them back.", "label": 1, "label_text": "counterfactual"}
{"text": "I read through the book fairly quickly, wish there was more to the story.", "label": 1, "label_text": "counterfactual"}
{"text": "I thought it should have used more of esp or visions angle and mentioned at the end whether or not if he still had the visions.", "label": 1, "label_text": "counterfactual"}
{"text": "If it had a weighted bottom I would have given it 4/5 stars.", "label": 1, "label_text": "counterfactual"}
{"text": "Wish there were a couple of weeks of menus.", "label": 1, "label_text": "counterfactual"}
{"text": "Now if I could just figure out how to program it into my universal remote...one day.", "label": 1, "label_text": "counterfactual"}
{"text": "I would have liked a bit more history woven in because the references to the Flatey book's historical figures were not well known to me.", "label": 1, "label_text": "counterfactual"}
{"text": "The hat fits her but already looks slightly small, I wish I had ordered the bigger size.", "label": 1, "label_text": "counterfactual"}
{"text": "Wish writers would stop making girls look like they don't know who to choose and such.", "label": 1, "label_text": "counterfactual"}
{"text": "Cons: I wish the individual heads were perforated so i could cut off what i need.", "label": 1, "label_text": "counterfactual"}
{"text": "Probably would have enjoyed more if I hadn't spent so much focus on tracking placement in the book.", "label": 1, "label_text": "counterfactual"}
{"text": "If the errors had not been so irritating, I could have gone up to three stars.", "label": 1, "label_text": "counterfactual"}
{"text": "Though, I'm not one to get too upset by such things myself,  I do get why other people might have been upset by the liberties the movie took.", "label": 1, "label_text": "counterfactual"}
{"text": "Wish the shelves were a little farther apart as her toys are a big odd shaped and so the bigger ones have to go on the top shelf.", "label": 1, "label_text": "counterfactual"}
{"text": "Had the person handling the shipping of this item been at all concerned with the use of the product at the end of the mailing process, the slightest bit of care could have been taken to ensure it's proper delivery.", "label": 1, "label_text": "counterfactual"}
{"text": "It would have worked ok but is was way to small.", "label": 1, "label_text": "counterfactual"}
{"text": "If I had gotten the large, I think they would be ideal.", "label": 1, "label_text": "counterfactual"}
{"text": "I felt like the shorts would have benefited from a little more in-depth exploration of the ideas rather than taking the easy funny and some positively went straight over my head as to why they were included.", "label": 1, "label_text": "counterfactual"}
{"text": "If I could rate it zero stars, I would", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I had found this before I took the MCAT for the first time.", "label": 1, "label_text": "counterfactual"}
{"text": "I'm giving it 4 stars because I know if I got the right size they would have fit just fine.", "label": 1, "label_text": "counterfactual"}
{"text": "If you think leakage is a problem it really isn't they are as bad as a pair of ear-buds.", "label": 1, "label_text": "counterfactual"}
{"text": "It seem ok but I which I could get about 20% volume out of it.", "label": 1, "label_text": "counterfactual"}
{"text": "I hurried to test it out so that I could return it if necessary.", "label": 1, "label_text": "counterfactual"}
{"text": "Now, if only they would have been 'Prime' so I wouldn't have had to pay the $10 shipping!", "label": 1, "label_text": "counterfactual"}
{"text": "If I were going to purchase again, I would consider a synthetic bag that would not need to be washed and would be lighter.", "label": 1, "label_text": "counterfactual"}
{"text": "I would have given them 5 stars, but they are a little large for headphones and the battery only lasts for 3 hours.", "label": 1, "label_text": "counterfactual"}
{"text": "Also the part that makes the top a mock wrap is not adjustable which makes the top look loose, it should have been adjustable.", "label": 1, "label_text": "counterfactual"}
{"text": "i would give it no stars if that were possible.", "label": 1, "label_text": "counterfactual"}
{"text": "If they had other colors I would purchase them all.", "label": 1, "label_text": "counterfactual"}
{"text": "I think the ending could have been a lot better!", "label": 1, "label_text": "counterfactual"}
{"text": "I'm sure your heart is in the right place, but you should have waited!!", "label": 1, "label_text": "counterfactual"}
{"text": "What I would have liked to know before I bought this book.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I would have purchased one with more features.", "label": 1, "label_text": "counterfactual"}
{"text": "\"But oddly enough, the bottoms are a little too loose in the waist (37\\) and could have used another inch or two in the inseam ( I normally take a 35\\\"\" or 36\\\"\" in jeans, depending on the brand if this helps).\"\"\"", "label": 1, "label_text": "counterfactual"}
{"text": "wish there was more with the newswoman and   Harry.", "label": 1, "label_text": "counterfactual"}
{"text": "However, I think it would be better if you read her books in order as the stories kind of build on each other.", "label": 1, "label_text": "counterfactual"}
{"text": "I would have thought this apron would have held up better with just one wash.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish there were a way to return e-books.", "label": 1, "label_text": "counterfactual"}
{"text": "I would have kept them if they were $5.00, but definitely NOT worth the price at all.", "label": 1, "label_text": "counterfactual"}
{"text": "Wish I could cause I would love to know about Ruby's new adventure.", "label": 1, "label_text": "counterfactual"}
{"text": "I should have read more reviews myself before buying these.", "label": 1, "label_text": "counterfactual"}
{"text": "It comes with a pretty flat sheet (a cute single riffle at top edge), I would've loved it even more if it came with a fitted sheet too!", "label": 1, "label_text": "counterfactual"}
{"text": "I could do without the bottle opener attached to the cargo pocket.", "label": 1, "label_text": "counterfactual"}
{"text": "wish it was diiferent as the dress looks very pretty on the picture", "label": 1, "label_text": "counterfactual"}
{"text": "It is clear neither of them could have survived for long without the other.", "label": 1, "label_text": "counterfactual"}
{"text": "It must have been broken prior to shipping, as put together, it would not have fit in the box It is serving it's purpose, as I sew Angel Gowns (NICU baby burial dresses) from donated wedding gowns, and I wanted it to display the desses for photographing them prior to shipping for distribution to their final destination of participating hospitals nationwide.", "label": 1, "label_text": "counterfactual"}
{"text": "this belt fits a tiny bit smaller that i expected my waist size is 32 so i got the 32 and wish i got the 34 for a little extra belt room.", "label": 1, "label_text": "counterfactual"}
{"text": "I would have gone to an XL, but then the collar would have been too wide.", "label": 1, "label_text": "counterfactual"}
{"text": "I am really bummed out about having to return it, but it would have been a great buy.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I weren't friends with the author.", "label": 1, "label_text": "counterfactual"}
