{"text": "With this pad turned on the memory foam is always soft and squishy.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I was able to return the bulb and received back payment without issue.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I ordered a white curtain to go behind a clear shower curtain (with a duck design on it) and it looks very nice and is not see through at all.", "label": 0, "label_text": "not-counterfactual"}
{"text": "By the time this story is done, I could have purchased 8 books!", "label": 0, "label_text": "not-counterfactual"}
{"text": "I'm losing weight again and hope to be too small to wear them next month, but they are really good pants and I may replace them with something smaller.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This little machine has a child proof type lid like on medicine bottles making it very difficult to press, squeese and twist off....it does not open smoothly and I had to apply pressure to press down, it exploded and blew the top right off like a pressure cooker, burning my hand and face badly!", "label": 0, "label_text": "not-counterfactual"}
{"text": "I loved the volume control on the headphones themselves.", "label": 0, "label_text": "not-counterfactual"}
{"text": "But its not bad enough for me to stop using them.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I have yet to clean the dress, partly because I haven't found any care instructions.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It was packaged well & comes with little rubber feet on the legs so nothing gets scratched and there's no slipping around & you also get a little baggy with a couple extra.", "label": 0, "label_text": "not-counterfactual"}
{"text": "\"I could absolutely relate to the main character's dilemmas, because Asian families can be very successful in \\guilting\\\"\" each other into complying with family expectations.\"\"\"", "label": 0, "label_text": "not-counterfactual"}
{"text": "Also wish the cord was solid and not one that can be pulled out so easily, but it is also a safety feature.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I wanted something that would enable me to keep up with the news/weather when camped out in the boonies.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Permanent filters do become clogged over time and simply must be replaced.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The shipping was loads faster than expected, too!", "label": 0, "label_text": "not-counterfactual"}
{"text": "It would be better to spend more money for a product that is built of better materials.", "label": 0, "label_text": "not-counterfactual"}
{"text": "My blanket is full of pulls and loose threads after less than a month's use.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This is first bluetooth that I own that can pair two phones and it has worked good.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This is not worth $60 to me if it rips after a week.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It does not just talk about the theory behind the topic but offers simple steps to exercise the principles and become a happier more content and productive  person both in your private as well as your professional life.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I thought these were very beautiful on line but when I received them, I couldn't take my eyes off them.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I chose the RCA connection over the speaker level connections.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It certainly doesn't live up to the fantastic precedent set by Spy vs.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Bank and Gaza city of thompson falls in love with your kindle fire and rescue plan for the most important thing is the kindle fire department for sure to check it out for sure to use none of them", "label": 0, "label_text": "not-counterfactual"}
{"text": "I bought two of these because I have a 3200 watt amp and I wanted subs that would utilize the power coming out of my amp.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The scrubber comes with two heads, and you'll probably have to experiment a  bit with both of them to figure out which ones work best for which jobs, and the motor's not quite as powerful as I would like... pressing down too much can cause the head to stop rotating.", "label": 0, "label_text": "not-counterfactual"}
{"text": "These pants are comfortable and turned out to be just what I was looking for.", "label": 0, "label_text": "not-counterfactual"}
{"text": "They do not change much from year to year they should be a little more interesting looking.", "label": 0, "label_text": "not-counterfactual"}
{"text": "HE WAS TRUE TO HIS WORD AND WE HAD A BRAND NEW CART THE VERY NEXT DAY AND THE PREPAID RETURN LABEL WITHIN SECONDS VIA EMAIL.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This is more a minimalist wallet than a money clip which is what I was originally looking for so was a bit disappointed but as a minimalist wallet it is quite nice although I would do without the clip which would make it even slimmer.", "label": 0, "label_text": "not-counterfactual"}
{"text": "(I've uploaded a picture so you can see what a difference it made.)", "label": 0, "label_text": "not-counterfactual"}
{"text": "And, they're the best priced headphones you'll find.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I had a hard time getting it to go on my king sized bed, even though there is plenty of depth and stretch to the sides.", "label": 0, "label_text": "not-counterfactual"}
{"text": "When the darker or more action packed books are becoming too much, I like to get lost in books just about real people going on real life journeys.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Really nice cases, just wish they were a bit longer.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The runner is nice, especially on a black top, but the one thing I'm disappointed with is that a few of the threads are not woven correctly around the bamboo.", "label": 0, "label_text": "not-counterfactual"}
{"text": "If you like a bit of brutality in your femdom abduction stories, this one will probably appeal to you.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It also came with a bag which is plenty big to place the mattress in.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The sheets...maybe a different seller...CHEAPLY made and silky again...they won't stay tucked into the mattress.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I purchased this to add a bit of sparkle to my wedding decorations.", "label": 0, "label_text": "not-counterfactual"}
{"text": "(They were packaged in some oversized, random bags.)", "label": 0, "label_text": "not-counterfactual"}
{"text": "The author does a great job of showing the relationships between the various characters.", "label": 0, "label_text": "not-counterfactual"}
{"text": "\"I highly recommend JIRBS for anyone with some theological acumen who would call himself a Reformed Baptist--even if he wouldn't consider himself \\\\\\\\\\confessional.\\\\\\\\\\\"\" We need to understand the issues and thought that impelled our Baptist forebears in their intellectual efforts and their personal sacrifices and why those still matter today.\"\"\"", "label": 0, "label_text": "not-counterfactual"}
{"text": "The bag come when they said it would be there.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Once on the fit is perfect but so was the 40 inch so I will probably go back to that size next time I order this bra.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Overall I would recommend and buy this product over and over, except get a longer usb.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This is a great product, fit and the quality is way more than expected.", "label": 0, "label_text": "not-counterfactual"}
{"text": "What I love about this book is the character development.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I can't stand earbuds anymore, so I started looking for an economy priced over the ear option.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I wanted an oil that made me smell like I fell in a rose bush and laid there for hours.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I just love all of your books and was trying to hold off on reading this series until it was all out but the more comments I saw the harder it got until one night I gave in and now, well let's just say that I feel like a kid feels the night before Christmas!!!!!", "label": 0, "label_text": "not-counterfactual"}
{"text": "The whole reason for going with this style antenna was the hope that I could mount it on the front of the house facing the transmitters without it looking bad.", "label": 0, "label_text": "not-counterfactual"}
{"text": "More often I would wake up with itchy eyes and would have a hard time sleeping with a clogged nose.", "label": 0, "label_text": "not-counterfactual"}
{"text": "(I HAVEN'T WASHED IT YET SO COMPLAINT COULD CHANGE!!)", "label": 0, "label_text": "not-counterfactual"}
{"text": "Breautiful...bright and silky...couldn't be better.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Back is designed so that I get a smoother back under my knits.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The clock won't keep time and looses at least an hour per month, but the thermometer is useful.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I got a medium and they are not big.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It turns out, that button also doesn't play music.", "label": 0, "label_text": "not-counterfactual"}
{"text": "because we had some vacation photos that were an unusual size that we wanted to frame (you know the ones they take for you and then charge an outrageous amount to buy at the end of the day).", "label": 0, "label_text": "not-counterfactual"}
{"text": "However, I like that the little stoppers are removable.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I've purchased generic batteries for replacements in my UPS's before and never had any problems.", "label": 0, "label_text": "not-counterfactual"}
{"text": "This book is darker than book one, as their relationship takes a hit & Violet must regain Rhys trust.", "label": 0, "label_text": "not-counterfactual"}
{"text": "These are the ones I would recommend this for.", "label": 0, "label_text": "not-counterfactual"}
{"text": "But it could be difficult to get a picture with the exact shade.", "label": 1, "label_text": "counterfactual"}
{"text": "The hat fits her but already looks slightly small, I wish I had ordered the bigger size.", "label": 1, "label_text": "counterfactual"}
{"text": "Still a cute top, but I probably should have gone for 3X, which is 3 sizes larger than what I normally wear.", "label": 1, "label_text": "counterfactual"}
{"text": "I do not recommend these books to anyone and honestly wish I could give less than a 1 star review.", "label": 1, "label_text": "counterfactual"}
{"text": "Could be used as an ornament at Christmas or to hang in the car.", "label": 1, "label_text": "counterfactual"}
{"text": "Good story too, felt like it could have been real and with a historical setting that added more to the undercurrent of social comment than to the actual storyline of this compelling mystery.", "label": 1, "label_text": "counterfactual"}
{"text": "In fact, it would have been better if the story had been told from Grandma's perspective.", "label": 1, "label_text": "counterfactual"}
{"text": "There were several tantalizing directions I could have seen the story moving into, but it never did.", "label": 1, "label_text": "counterfactual"}
{"text": "I would've preferred to get the item I ordered.", "label": 1, "label_text": "counterfactual"}
{"text": "Maybe I got a deffective hamper, but I had to return it because it had a big rip at the bottom and I could tell that even if that rip wasn't there, I doubt it would have hold a lot of clothes.", "label": 1, "label_text": "counterfactual"}
{"text": "It would be better if it was lighter instead of a dirty, yellow tone beige.", "label": 1, "label_text": "counterfactual"}
{"text": "I would give them a 5 star review if both ends of the buckle were the same, in other words, I feel the right side of the buckle in the picture should be the same as the left side which will hold the webbing.", "label": 1, "label_text": "counterfactual"}
{"text": "She should have know something was a miss when she offered her more money.", "label": 1, "label_text": "counterfactual"}
{"text": "Would have liked the option for a longer size.", "label": 1, "label_text": "counterfactual"}
{"text": "ZIP ONLY MADE 2 WEEKS BOTTONS FAILED, WISH I NEVER BROUGHT IT", "label": 1, "label_text": "counterfactual"}
{"text": "My review would be more positive if I would have been able to see a front view of the hat.", "label": 1, "label_text": "counterfactual"}
{"text": "\"Aside from the light material, the hat looks to be well made, just a little heavier material would have given this hat a higher rating than its three star \\it's okay\\\"\" rating.\"\"\"", "label": 1, "label_text": "counterfactual"}
{"text": "However, they stretch quite a bit after wearing for a few hours so I wish I had exchanged for the 28.", "label": 1, "label_text": "counterfactual"}
{"text": "I do wish it had a label holder on the front so I could label the baskets with what's inside (ie: blocks, toy cars, etc).", "label": 1, "label_text": "counterfactual"}
{"text": "While this should have been exactly what I needed, the converter is very intermittent.", "label": 1, "label_text": "counterfactual"}
{"text": "\"From the picture the dress looks like it should be long enough for someone at lease 5' 6\\.\"\"\"", "label": 1, "label_text": "counterfactual"}
{"text": "This works great in my basement , although hind sight I wish I would have bought one with a larger capacity.", "label": 1, "label_text": "counterfactual"}
{"text": "An aspect that could have contributed greatly to my overall fitness – and that aspect is alkaline water.", "label": 1, "label_text": "counterfactual"}
{"text": "These are great little products if you absolutely need these colors.", "label": 1, "label_text": "counterfactual"}
{"text": "It would be a great movie, I think -- awesome for Jennifer Lawrence!", "label": 1, "label_text": "counterfactual"}
{"text": "If you placed this under a pad then I guess it would be a good pad to protect your mattress, but then again what would be the point of that?", "label": 1, "label_text": "counterfactual"}
{"text": "Wished it could have been a little longer though as it was so good.", "label": 1, "label_text": "counterfactual"}
{"text": "Wish the shelves were a little farther apart as her toys are a big odd shaped and so the bigger ones have to go on the top shelf.", "label": 1, "label_text": "counterfactual"}
{"text": "As mentioned in earlier reviews, make sure that the TV or monitor you want to use this with specifically supports Component-VGA - if it doesn't, then you should save your money and look for an alternative solution.", "label": 1, "label_text": "counterfactual"}
{"text": "I do wish the button could be replaced by a hook, like these pants used to have.", "label": 1, "label_text": "counterfactual"}
{"text": "I would have enjoyed it more if Evan could be seen as a better role model to younger readers.", "label": 1, "label_text": "counterfactual"}
{"text": "Probably would have enjoyed more if I hadn't spent so much focus on tracking placement in the book.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I had been like her when I was 19-20.", "label": 1, "label_text": "counterfactual"}
{"text": "The storyline is quite clear, however I wish the relationship between many of the characters were more developed.", "label": 1, "label_text": "counterfactual"}
{"text": "this belt fits a tiny bit smaller that i expected my waist size is 32 so i got the 32 and wish i got the 34 for a little extra belt room.", "label": 1, "label_text": "counterfactual"}
{"text": "I ordered up on this top but i think i could of just ordered the 1X and would have been fine but im ok with it i dont mind if its loose i still like it", "label": 1, "label_text": "counterfactual"}
{"text": "No extras-even FM radio would have been a nice touch.", "label": 1, "label_text": "counterfactual"}
{"text": "Also the part that makes the top a mock wrap is not adjustable which makes the top look loose, it should have been adjustable.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I had found this before I took the MCAT for the first time.", "label": 1, "label_text": "counterfactual"}
{"text": "I think I would have been happier with the print version, and that's no fault of the actual content.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I could just order the older version that they had because that one still works.", "label": 1, "label_text": "counterfactual"}
{"text": "Sheets are a bit thinner than I would have expected for the thread count, but they are soft.", "label": 1, "label_text": "counterfactual"}
{"text": "Could have done without the explicit, gory details of the fights--skipped over those parts.", "label": 1, "label_text": "counterfactual"}
{"text": "I just wish it would come with a plastic pole instead of metal as I just know it will eventually rust!", "label": 1, "label_text": "counterfactual"}
{"text": "It could have used another snap there, to close it up..", "label": 1, "label_text": "counterfactual"}
{"text": "Since I have not bought a bathing suit in years since I am not a swimmer , I perhaps should have gotten a half size bigger but I am only going back and forth in the pool so it is just fine.", "label": 1, "label_text": "counterfactual"}
{"text": "The ending came on a little fast and could have been a little more through, but even still I thought it was good.", "label": 1, "label_text": "counterfactual"}
{"text": "\"It was very difficult to unhook from the bracket on the wall, and I had to \\\\\\\\\\muscle\\\\\\\\\\\"\" it a little more than I would have liked to.\"\"\"", "label": 1, "label_text": "counterfactual"}
{"text": "In person it looks as though it would have cost a lot more.", "label": 1, "label_text": "counterfactual"}
{"text": "If is a easy space and flat it would work perfectly but I tried it in my stairs case which it has rug and also my car and it didn't do nothing at all.", "label": 1, "label_text": "counterfactual"}
{"text": "It seem ok but I which I could get about 20% volume out of it.", "label": 1, "label_text": "counterfactual"}
{"text": "Would be nice if the box displayed the current channel.", "label": 1, "label_text": "counterfactual"}
{"text": "Wish I had read what they were thought they might be actually key size but more of a charm....cute though and my collector son should love them.", "label": 1, "label_text": "counterfactual"}
{"text": "I should have listened to all the people who posted reviews.", "label": 1, "label_text": "counterfactual"}
{"text": "I would have thought this apron would have held up better with just one wash.", "label": 1, "label_text": "counterfactual"}
{"text": "Sad to say, I should have listened to the complaints about lack of a tone control button.", "label": 1, "label_text": "counterfactual"}
{"text": "The fabric is very nice and the case would have been excellent if it was used on the inside as well.", "label": 1, "label_text": "counterfactual"}
{"text": "Would be good if you could look at his menu first", "label": 1, "label_text": "counterfactual"}
{"text": "The zipper part should be longer to fit wider mattresses.", "label": 1, "label_text": "counterfactual"}
{"text": "I like these for stitch markers but wish you'd carry the 1 inch size.", "label": 1, "label_text": "counterfactual"}
{"text": "It was priced at 1/2 of what it would have been at a local shop.", "label": 1, "label_text": "counterfactual"}
{"text": "Ornament wasn't that nice - could have done a better job with the paint.", "label": 1, "label_text": "counterfactual"}
{"text": "Doesn't really complement beach photos--a sandy beige, yellow, or cyan, or any other color would have made this photo album perfect.", "label": 1, "label_text": "counterfactual"}
{"text": "I would have given it five stars but the power button is very sensitive, I'm constantly disconnecting the calls.", "label": 1, "label_text": "counterfactual"}
