{"text": "You hear it every time you turn your head around.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The tab could have been a quarter inch longer.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I feel that Kara has a habit of making bad life choices, a new relationship in the book really annoys me, and I wasn't a fan of the genre swap to High Fantasy.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Sheets that came with it didn't match bedding.", "label": 0, "label_text": "not-counterfactual"}
{"text": "The leather is smooth and supple and smells like leather, It has a trifold opening -- a third part that a license might fit into and come out more easily -- but that also opens for another card you might want to remove easily.", "label": 0, "label_text": "not-counterfactual"}
{"text": "They hold up well and still look great after lots of washing.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I wasn't too impressed with the 160 gram twin bed sheets I bought for my kids, shed and pilled like crazy.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I agree with the other reviews that this book is an excellent source for an introduction and explanation into BDSM, without all the dither of 50 Shades type books.", "label": 0, "label_text": "not-counterfactual"}
{"text": "There were one or two spots where the whole agonizing over confessing emotions was a tiny bit much even for me, but that could be a preference thing.", "label": 0, "label_text": "not-counterfactual"}
{"text": "It's a huge disappointment that Sonos doesn't offer AirPlay support.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I'm sad to see the series end, but Towle hit it out of the park with this book.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Like I said, the story was cute it just left this reader wishing for more development.", "label": 0, "label_text": "not-counterfactual"}
{"text": "I love my FilterQueen Vacume but wanted the floor tool to use instead of the power head.", "label": 0, "label_text": "not-counterfactual"}
{"text": "the rubber seals are dried and hard and do not seal properly.", "label": 0, "label_text": "not-counterfactual"}
{"text": "\"It works, but it did disable my \\eco\\\"\" mode setting.\"\"\"", "label": 0, "label_text": "not-counterfactual"}
{"text": "Works as wipe tied and came with a nice instruction booklet with info on programming it for all my devices.", "label": 0, "label_text": "not-counterfactual"}
{"text": "Moreover, this work is in the public domain anyway and should have been copyright free, hence $0.", "label": 1, "label_text": "counterfactual"}
{"text": "If the seller is going to sell irregular shirts on Amazon, they should be required to state they are irregular.", "label": 1, "label_text": "counterfactual"}
{"text": "I could never have guessed the ending, but it was a great ending!", "label": 1, "label_text": "counterfactual"}
{"text": "It has the same great comfortable & flattering features plus the great denim texture that Lee has perfected- smoothing and stretchy without the excessive cling- but I think it must have been designed for people who have a greater surplus of belly fat than I.", "label": 1, "label_text": "counterfactual"}
{"text": "Only wish I could find the matching curtains mentioned in the description but haven't been able to find them anywhere :(", "label": 1, "label_text": "counterfactual"}
{"text": "Ending could have been a little stronger but it was a fabulous read.", "label": 1, "label_text": "counterfactual"}
{"text": "I should have listened to all the people who posted reviews.", "label": 1, "label_text": "counterfactual"}
{"text": "I wish I had read the reviews before I bought it.", "label": 1, "label_text": "counterfactual"}
{"text": "I could have probably ordered the extra small but I am happy with the small, just a little wiggle room.", "label": 1, "label_text": "counterfactual"}
{"text": "Wish I would mix and match the top and bottom with different sizes.", "label": 1, "label_text": "counterfactual"}
{"text": "I like the shorts and the details on it, but I wish it was a little longer because my thighs are a bit much for it.", "label": 1, "label_text": "counterfactual"}
{"text": "I ordered up on this top but i think i could of just ordered the 1X and would have been fine but im ok with it i dont mind if its loose i still like it", "label": 1, "label_text": "counterfactual"}
{"text": "Wish the shipping was cheaper, but definitely worth the extra couple bucks, great purchase!", "label": 1, "label_text": "counterfactual"}
{"text": "did not work very long, not worth the money at all...i should have sent them back.", "label": 1, "label_text": "counterfactual"}
{"text": "I read through the book fairly quickly, wish there was more to the story.", "label": 1, "label_text": "counterfactual"}
{"text": "I thought it should have used more of esp or visions angle and mentioned at the end whether or not if he still had the visions.", "label": 1, "label_text": "counterfactual"}
